<div>
    <h3> A Model Peer-to-Peer Retail Application Database </h3>
    <h3> Micah Simmerman </h3>
    <h3> CSPB 3287 Semester Project </h3>
</div>

Introduction

## Logistics

The following will load the SQL extension and connect to the `patent_citations` database using your MySQL credentials.

In [1]:
import os
import configparser
from sqlalchemy import create_engine, select
import sqlalchemy.sql


mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")

database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url 
eng = create_engine(db_url)
con = eng.connect()

User    : [jasi9001]
Database: [[mysql://jasi9001...@applied-sql.cs.colorado.edu:3306/jasi9001]

In [2]:
%reload_ext sql
%matplotlib inline
%sql SELECT version()

1 rows affected.

[('8.0.27',)]

## User-admin management tier

In [129]:
%%sql
drop table if exists user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [130]:
%%sql
# User table is the central table in the user-admin management section.
CREATE TABLE user (
    user_id INT PRIMARY KEY AUTO_INCREMENT,
    username VARCHAR(30) UNIQUE,
    password NVARCHAR(30),
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    email VARCHAR(300) UNIQUE,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [131]:
user_data_1 = [["user_01","user_passwd_01","Joe","Murr", "user_01_@email.com"],
               ["user_02","user_passwd_02","Brice","Toven", "user_02_@email.com"],
               ["user_03","user_passwd_03","Jen","Jackson", "user_03_@email.com"],
               ["user_04","user_passwd_04","Tammy","Smith", "user_04_@email.com"],
               ["user_05","user_passwd_05","Melanie ","Baldwin", "user_05_@email.com"],
               ["admin_06","admin_passwd_06","Rene ","Pratt", "admin_06_@email.com"],
               ["admin_07","admin_passwd_07","Malik ","Coleman", "admin_07_@email.com"],
               ["admin_08","admin_passwd_08","Sheldon ","Wolf", "admin_08_@email.com"],
               ["admin_09","admin_passwd_09","Ramiro","Blackwell", "admin_09_@email.com"],
               ["admin_10","admin_passwd_10","Suzy","Q", "admin_10_@email.com"],  # Ramiro made two accounts
               # The next two inserts should fail due to UNIQUE unsername and email constraints, respectively.
               ["user_01","test_password_01","Duplicate","Username", "un_test_email@email.com"],
               ["poser_08","test_password_08","Duplicate","Email", "user_01_@email.com"]
              ]

In [132]:
insert_users = """
INSERT INTO 
    user (username, password, first_name, last_name, email)
VALUES
    ("%s","%s","%s","%s", "%s");
"""
count = 1
for user in user_data_1:
    try:
        res = con.execute(insert_users, user[0], user[1], user[2], user[3], user[4])
        print("Insert:", user[2], user[3], "was successful.")
    except:
        print("Insert:", user[2], user[3], "FAILED.")
    count+=1

Insert: Joe Murr was successful.
Insert: Brice Toven was successful.
Insert: Jen Jackson was successful.
Insert: Tammy Smith was successful.
Insert: Melanie  Baldwin was successful.
Insert: Rene  Pratt was successful.
Insert: Malik  Coleman was successful.
Insert: Sheldon  Wolf was successful.
Insert: Ramiro Blackwell was successful.
Insert: Suzy Q was successful.
Insert: Duplicate Username FAILED.
Insert: Duplicate Email FAILED.

In [133]:
%%sql
SELECT * FROM user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[(1, "'user_01'", "'user_passwd_01'", "'Joe'", "'Murr'", "'user_01_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (2, "'user_02'", "'user_passwd_02'", "'Brice'", "'Toven'", "'user_02_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", "'user_03_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (4, "'user_04'", "'user_passwd_04'", "'Tammy'", "'Smith'", "'user_04_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (5, "'user_05'", "'user_passwd_05'", "'Melanie '", "'Baldwin'", "'user_05_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (6, "'admin_06'", "'admin_passwd_06'", "'Rene '", "'Pratt'", "'admin_06_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (7, "'admin_07'", "'admin_passwd_07'", "'Malik '", "'Coleman'", "'admin_07_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (8, "'admin_08'", "'admin_passwd_08'", "'Sheldon '", "'Wolf'", "'admin_08_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (9, "'admin_09'", "'admin_passwd_09'", "'Ramiro'", "'Blackwell'", "'admin_09_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37)),
 (10, "'admin_10'", "'admin_passwd_10'", "'Suzy'", "'Q'", "'admin_10_@email.com'", datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 37))]

### The update trigger was placed on the 'modified_at' column at the time of the table's creation.

In [134]:
%%sql
# Change Brice Toven's email to make sure the update trigger is working properly.
UPDATE user
SET
    email = 'brice_toven_07@gmail.com'  # CHANGE THIS VALUE TO SEE THE UPDATE TRIGGER
WHERE
    user_id = 3;
    
SELECT * FROM user WHERE user_id = 3;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'brice_toven_07@gmail.com', datetime.datetime(2023, 4, 23, 20, 34, 37), datetime.datetime(2023, 4, 23, 20, 34, 44))]

# LOGICAL BREAK

## The 'adminuser' table is a weak entity of the 'user' table.

### Rene Pratt, Malik Coleman, Sheldon Wolf, and Ramiro Blackwell have different roles within the P2P Ecommmerce system. 

    -Rene is a Business Administrator for company X who sells items on the retail website. 
    -Malik is a requisitioner at Company X, he makes sure that inventory stays in stock.
    -Sheldon works in our IT department and sometimes he needs to fix glitches in the company software
    -Ramiro works in the warehouse, he needs to check on stock inventory and existing orders from time to time.
    
### The adminuser table has the same 'created_at' and 'modified_at' timestamp columns with triggers as the user table. 
### The admin_type describes the user's business role in the system. (This project does not cover permissions).

In [135]:
%%sql
drop table if exists adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [136]:
%%sql
# The admin_user table consumed the admin_type table, it presents a much more normalized form.
CREATE TABLE adminuser (
    admin_id INT PRIMARY KEY,
    admin_type VARCHAR(30),  # BusinessAdmin / Requisitioner / IT / Warehouse
    permissions VARCHAR(30),  # '01_admin' / '02_purchaser' / '03_IT' / '04_warehouse'
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT ADMINUSER_isA_USER FOREIGN KEY (admin_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);
#

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [137]:
admin_data = [[6, 'BusinessAdmin', '01_admin'],
          [7, 'Requisitioner', '02_purchaser'],
          [8, 'IT', '03_IT'],
          [9, 'Warehouse', '04_warehouse'],
          [10, 'Warehouse', '04_warehouse']]

In [138]:
insert_admins = """
INSERT INTO 
    adminuser (admin_id, admin_type, permissions)
VALUES
    ("%s","%s","%s");
"""

for admin in admin_data:
    # res = con.execute(insert_admins, admin[0], admin[1], admin[2])
    try:
        res = con.execute(insert_admins, admin[0], admin[1], admin[2])
        print("Insert for admin id:", admin[0], "was successful.")
    except:
        print("Insert for admin id:", admin[0], "has FAILED.")

Insert for admin id: 6 was successful.
Insert for admin id: 7 was successful.
Insert for admin id: 8 was successful.
Insert for admin id: 9 was successful.
Insert for admin id: 10 was successful.

In [139]:
%%sql
# Once again, we check that the 'created_at' and 'modified_at' triggers are working.
UPDATE adminuser
SET
    permissions = '02_admin'  # Update Rene Pratt's admin priveledges and check the modified_at timestamp trigger.
WHERE
    admin_id = 6;
    
SELECT * FROM adminuser WHERE admin_id = '6';

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(6, "'BusinessAdmin'", '02_admin', datetime.datetime(2023, 4, 23, 20, 34, 50), datetime.datetime(2023, 4, 23, 20, 34, 52))]

### Checking that the on-delete-cascade trigger works. It was added onto the foreign key constraint when the adminuser table was created.

In [142]:
%%sql
select * from adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
4 rows affected.

[(6, "'BusinessAdmin'", '02_admin', datetime.datetime(2023, 4, 23, 20, 34, 50), datetime.datetime(2023, 4, 23, 20, 34, 52)),
 (7, "'Requisitioner'", "'02_purchaser'", datetime.datetime(2023, 4, 23, 20, 34, 50), datetime.datetime(2023, 4, 23, 20, 34, 50)),
 (8, "'IT'", "'03_IT'", datetime.datetime(2023, 4, 23, 20, 34, 50), datetime.datetime(2023, 4, 23, 20, 34, 50)),
 (9, "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 4, 23, 20, 34, 50), datetime.datetime(2023, 4, 23, 20, 34, 50))]

### Say the warehouse worker with admin_id=10 recently accepted a job at another company... Let's delete their record from the user table and make sure that the on-delete-cascade trigger works between the primary and foreign key. Deleting The record from the user table should remove the tuple from adminuser. Run the cell below, and then run the cell above again (admin_id=10 should disappear).

In [141]:
%%sql
# remember to rebuild the table after this.
DELETE FROM user WHERE user_id = 10;  # delete user_id=10 from the user table. (to view the cascade)

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[]

# LOGICAL BREAK

In [148]:
%%sql
# 
CREATE TABLE user_address (
    address_id INT PRIMARY KEY AUTO_INCREMENT,  # this will give us all the information we need to know about a given address (for receipts and such).
    user_id INT,  #  user_address.user_id refers to user.user_id
    address_line1 VARCHAR(100) NOT NULL,  # e.g., 1312 Cherry Basket ln.
    address_line2 VARCHAR(100),  # e.g., Unit 2
    city VARCHAR(40) NOT NULL,  # e.g., Midland
    state VARCHAR(15) NOT NULL,  # e.g., Texas
    postal_code VARCHAR(15) NOT NULL, # e.g., 79701
    country VARCHAR(56),  # e.g., United States
    phone_number VARCHAR(15) NOT NULL, # e.g., (702)579-0585
    
    CONSTRAINT USER_ADDRESS_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [149]:
user_addresses = [[1, "8447C Airport Street", "Apt#2", "Klamath Falls","OR", "97603", "United States", "(102)479-4505"],
                  [2, "328 Saxton St.", "N/A", "Englewood","NJ", "07631", "United States", "(202)484-0535"],
                  [3, "8539 W. Olive Court", "N/A", "Bemidji","MN", "56601", "United States", "(502)474-7505"],
                  [4, "467 Cooper St.", "N/A", "Ottumwa","IA", "52501", "United States", "(702)579-0585"],
                  [5, "9154 Main Court", "N/A", "Latrobe","PA", "15650", "United States", "(702)579-0585"],
                  [6, "7019 E. Border Street", "N/A", "Strongsville","Strongsville", "OH", "United States", "(702)579-0585"],
                  [7, "819 Aspen Ave.", "N/A", "Maplewood","NJ", "07040", "United States", "(702)579-0585"],
                  [8, "admin_08","9216 W. Greenview Ave.", "N/A", "Williamstown","NJ", "08094", "United States", "(502)479-4505"],
                  [9,"426 N. Bay Meadows Rd.", "N/A", "Largo","FL", "33771", "United States", "(402)455-4599"],
                  # Inserting multiple records with the same user_id is allowed. Next insert should pass.
                  [8,"8546 Laurel Ave.","N/A","Avon Lake", "OH", "44012", "United States", "(102)479-4505"],
                  # The last insert should fail because this user_id does not exist in user table. So it should fail according to the FK constraint.
                  [11,"8320 W. Brookside Street","N/A","Streamwood", "IL", "60107", "United States", "(102)479-4505"],
                 ]

In [145]:
insert_user_address = """
INSERT INTO 
    user_address (user_id, address_line1, address_line2, city, state, postal_code, country, phone_number)
VALUES
    ("%s","%s","%s","%s","%s","%s","%s","%s");
"""

for user in user_addresses:
    # res = con.execute(insert_admins, admin[0], admin[1], admin[2])
    try:
        res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7])
        print("user_id:", user[0], "'s address was inserted successfully.")
    except:
        print("user_id:", user[0], "'s address insertion FAILED.")

user_id: 1 's address was inserted successfully.
user_id: 2 's address was inserted successfully.
user_id: 3 's address was inserted successfully.
user_id: 4 's address was inserted successfully.
user_id: 5 's address was inserted successfully.
user_id: 6 's address was inserted successfully.
user_id: 7 's address was inserted successfully.
user_id: 8 's address was inserted successfully.
user_id: 9 's address was inserted successfully.
user_id: 8 's address was inserted successfully.
user_id: 11 's address insertion FAILED.

### Since 'user_address' is connected to user by a FK reference, it will be good to keep an index on user_address.user_id.

In [146]:
%%sql
# Because this is what conects user_address to the user table, we want to place an index on user_address.user_id.
CREATE INDEX user_id_FK 
ON user_address (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [147]:
%%sql
DROP TABLE IF EXISTS user_address;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# LOGICAL BREAK
### Create the user_payment table.

### The Ecommerce Company has decided to accept only credit or debit cards.

In [297]:
%%sql
CREATE TABLE user_payment (
    payment_id INT PRIMARY KEY AUTO_INCREMENT,  # good to keep track of payment options.
    user_id INT NOT NULL,  # Foreign key that references user.user_id
    payment_type VARCHAR(40) NOT NULL,  # e.g.,          'DEBIT'            ...     'CREDIT'
    provider VARCHAR(100) NOT NULL,  # e.g., '(WELLS FARGO' | 'CHASE'| ...) ... ('VISA' | 'DISCOVERY' | ...) 
    card_number VARCHAR(20) NOT NULL,
    cvc VARCHAR(10) NOT NULL,  # always 3 numbers
    expiry VARCHAR(10),  # e.g., '2025-07' (cards typically expire the first day of the month.)
    
    # CONSTRAINT PAYMENT_TYPE_NO_DUPS UNIQUE(user_id, provider, card_number),  # users can have only one instance of each E-transfer provider, and one instance of each card.
    CONSTRAINT USER_PAYMENT_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

### Since neither 'user_id' and 'card_number' are primary keys, I have placed a unique non-clustered index on the two attributes two ensure that the table rejects duplicate card information for each user_id. [see tests below]

In [298]:
%%sql
# use a pre-insert trigger to prevent duplicate payment options from being entered into the table.
ALTER TABLE user_payment   
ADD CONSTRAINT NO_PAYMENT_DUPS UNIQUE NONCLUSTERED
(
    user_id, card_number
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [284]:
%%sql
# It will also be beneficial to keep an index on user_payment.user_id
CREATE UNIQUE INDEX PAYMENT_NO_DUPS
ON user_payment(user_id, card_number);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [293]:
user_payment_methods = [[1, "DEBIT", "CHASE", "4485202750970764", "505", "05/2024"],
                        [1, "CREDIT", "VISA", "4485858039365496", "391", "9/2023"], # user can have multiple cards
                        [2, "DEBIT", "VISA", "4539447657840026", "924", "07/2025"], 
                        [2, "CREDIT", "VISA", "4716013835369778", "804", "12/2024"], # 
                        [3, "CREDIT", "VISA", "4556994540374919", "536", "03/2022"],
                        [4, "DEBIT", "VISA", "4929053913134176", "958", "11/2023"],
                        [5, "CREDIT", "DISCOVERY", "4485596057592985", "713", "08/2029"],
                        [6, "CREDIT", "VISA", "4539628822621173", "121", "01/2028"],
                        [7, "CREDIT", "DISCOVERY", "4842467639356646", "548", "02/2026"],
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"],
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],
                        # The user_payment table should not allow duplicate payment information to be entered in the table. Last two should fail.
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"]]

In [294]:
insert_user_payment = """
INSERT INTO 
    user_payment (user_id, payment_type, provider, card_number, cvc, expiry)
VALUES
    ("%s","%s","%s","%s","%s", "%s");
"""

for payment in user_payment_methods:
    # res = con.execute(insert_user_payment, payment[0], payment[1], payment[2], payment[3], payment[4], payment[5])
    # print("user_id:", payment[0], "'s payment information was successfully inserted.")    
    try:
        res = con.execute(insert_user_payment, payment[0], payment[1], payment[2], payment[3], payment[4], payment[5])
        print("user_id:", payment[0], "'s payment information was successfully inserted.")
    except:
        print("user_id:", payment[0], "'s payment information insert FAILED.")

user_id: 1 's payment information was successfully inserted.
user_id: 1 's payment information was successfully inserted.
user_id: 2 's payment information was successfully inserted.
user_id: 2 's payment information was successfully inserted.
user_id: 3 's payment information was successfully inserted.
user_id: 4 's payment information was successfully inserted.
user_id: 5 's payment information was successfully inserted.
user_id: 6 's payment information was successfully inserted.
user_id: 7 's payment information was successfully inserted.
user_id: 8 's payment information was successfully inserted.
user_id: 9 's payment information was successfully inserted.
user_id: 9 's payment information insert FAILED.
user_id: 8 's payment information insert FAILED.

In [295]:
%%sql
select * from user_payment
order by user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
11 rows affected.

[(1, 1, "'DEBIT'", "'CHASE'", "'4485202750970764'", "'505'", "'05/2024'"),
 (2, 1, "'CREDIT'", "'VISA'", "'4485858039365496'", "'391'", "'9/2023'"),
 (3, 2, "'DEBIT'", "'VISA'", "'4539447657840026'", "'924'", "'07/2025'"),
 (4, 2, "'CREDIT'", "'VISA'", "'4716013835369778'", "'804'", "'12/2024'"),
 (5, 3, "'CREDIT'", "'VISA'", "'4556994540374919'", "'536'", "'03/2022'"),
 (6, 4, "'DEBIT'", "'WELLS FARGO'", "'4929053913134176'", "'958'", "'11/2023'"),
 (7, 5, "'CREDIT'", "'DISCOVERY'", "'4485596057592985'", "'713'", "'08/2029'"),
 (8, 6, "'CREDIT'", "'VISA'", "'4539628822621173'", "'121'", "'01/2028'"),
 (9, 7, "'CREDIT'", "'DISCOVERY'", "'4842467639356646'", "'548'", "'02/2026'"),
 (10, 8, "'DEBIT'", "'DISCOVERY'", "'4485944095819335'", "'788'", "'07/2024'"),
 (11, 9, "'CREDIT'", "'VISA'", "'4532191431974902'", "'267'", "'10/2025'")]

In [296]:
%%sql
drop table if exists user_payment;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# FIND REGISTERED USERS WITH ADMIN PRIVILEGES WITH MORE THAN ONE ADDRESS

### Now we can easily run a query to find the cross-section of users who also have admin rights in the system.

In [ ]:
%%sql

SELECT

In [ ]:
%%sql
# 
# CREATE TABLE user_payment (
#     id INT,
#     user_id INT,  # 
#     payment_type VARCHAR(40),  # best guess of what length should be.
#     provider VARCHAR(40),  # best guess of what length should be.
#     account_no VARCHAR(17),  # best guess of what length should be.
#     expiry DATE
# );